<template>
    <div class="PdfViewers">
        <embed :src="url+'#statusbar=1&toolbar=1&navpanes=1&scrollbar=0&zoom=10'"
               type="application/pdf"
               width="50%"
               height="500px"
               :page="page"
               >
<!--        <button @click="toPage(page-1)"> &lt; </button>-->
<!--        <button @click="toPage(page+1)"> &gt; </button>-->
<!--        internalinstanceid="50"-->
<!--        <vue-pdf-viewer height="500px" :url="url">-->
<!--        </vue-pdf-viewer>-->
    </div>
</template>

<script>

    import VuePDFViewer from 'vue-instant-pdf-viewer'
    export default {
        name: "PdfViewers",
        props: [],
        components: {'vue-pdf-viewer': VuePDFViewer},
        data() {
            return {
                // url: 'http://insaat.eskisehir.edu.tr/muhsiny/trs102/icerik/week-6.pdf',
                url: 'https://bitcoin.org/bitcoin.pdf',
                page: 2
            }
        },
        computed: {},
        methods: {
            toPage(v){
                this.page = v;
            },
        },
        mounted() {
        },
    }

    // ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |
    // |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅
    // ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |
    // |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅
    // ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |
    // |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅
    // ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |
    // |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅
    // ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |
    // |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅
    // ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |
    // |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅
    // ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |
    // |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅
    // ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |
    // |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅
    // ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |
    // |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅
    // ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |̅|_   |
    // |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|̅   |_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅|_|   ̅



</script>

<style lang="scss">
    .PdfViewers {

    }
</style>

